betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_can.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_can.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file provides all the CAN firmware functions.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32h417_can.h"
#include "ch32h417_rcc.h"

/* CAN CTLR Register bits */
#define CTLR_DBF                     ((uint32_t)0x00010000) 

/* CAN Mailbox Transmit Request */
#define TMIDxR_TXRQ                  ((uint32_t)0x00000001) 
/* Time out for INAK bit */
#define INAK_TIMEOUT                 ((uint32_t)0x0000FFFF)
/* Time out for SLAK bit */
#define SLAK_TIMEOUT                 ((uint32_t)0x0000FFFF)

/* Flags in TSTATR register */
#define CAN_FLAGS_TSTATR             ((uint32_t)0x08000000) 
/* Flags in RFIFO0 register */
#define CAN_FLAGS_RFIFO0             ((uint32_t)0x02000000) 
/* Flags in STATR register */
#define CAN_FLAGS_STATR              ((uint32_t)0x01000000) 
/* Flags in ERRSR register */
#define CAN_FLAGS_ERRSR              ((uint32_t)0x00F00000) 

/* Mailboxes definition */
#define CAN_TXMAILBOX_0              ((uint8_t)0x00)
#define CAN_TXMAILBOX_1              ((uint8_t)0x01)
#define CAN_TXMAILBOX_2              ((uint8_t)0x02) 

#define CAN_MODE_MASK                ((uint32_t) 0x00000003)

static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit);


/*********************************************************************
 * @fn      CAN_DeInit
 *
 * @brief   Deinitializes the CAN peripheral registers to their default reset
 *        values.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *
 * @return  none
 */
void CAN_DeInit(CAN_TypeDef* CANx)
{
	if (CANx == CAN1)
	{
	    RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN1,ENABLE);
	    RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN1,DISABLE);
	}else if (CANx == CAN2)
    {
        RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN2,ENABLE);
        RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN2,DISABLE);
    }else if (CANx == CAN3)
    {
        RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN3,ENABLE);
        RCC_HB1PeriphResetCmd(RCC_HB1Periph_CAN3,DISABLE);
    }
}

/*********************************************************************
 * @fn      CAN_Init
 *
 * @brief   Initializes the CAN peripheral according to the specified
 *        parameters in the CAN_InitStruct.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_InitStruct - pointer to a CAN_InitTypeDef structure that
 *        contains the configuration information for the CAN peripheral.
 *
 * @return  InitStatus - CAN InitStatus state.
*             CAN_InitStatus_Failed.
*             CAN_InitStatus_Success.
 */
uint8_t CAN_Init(CAN_TypeDef* CANx, CAN_InitTypeDef* CAN_InitStruct)
{
	uint8_t InitStatus = CAN_InitStatus_Failed;
	uint32_t wait_ack = 0x00000000;

		if(CAN1 == CANx)
        {
            (*(__IO uint32_t *)(0x40021014)) |= 0x02000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x02000000);
        }else if(CAN2 == CANx)
        {
            (*(__IO uint32_t *)(0x40021014)) |= 0x04000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x04000000);
        }else if(CAN3 == CANx)
		{
			(*(__IO uint32_t *)(0x40021014)) |= 0x01000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x01000000);
		}
        
        CANx->CTLR &= ~0x2;
        CANx->CTLR |= 0x1;
        
        while(!(CANx->STATR & 0x1) && (wait_ack != 0x0000FFFF))
        {
            wait_ack++;
        }

        if((CANx->STATR & 0x1))
        {
            CANx->BTIMR = ( uint32_t)0xC1100000| \
                                    ((uint32_t)SystemCoreClock/(((((*(__IO uint32_t *)(0x40021004)) >> 8) & 0x7) < 0x4) ? 1 : (uint32_t)0x2<<(((*(__IO uint32_t *)(0x40021004)) >> 8) & 0x3))/4000000 - 1);
        }
        else
        {
            return CAN_InitStatus_Failed;
        }
        CANx->CTLR &= ~0x1;
        wait_ack = 0;
        while((CANx->STATR & 0x1) && (wait_ack != 0x0000FFFF))
        {
            wait_ack++;
        }

        if((CANx->STATR & 0x1)){
            return CAN_InitStatus_Failed;
        }

        (*(__IO uint32_t *)(0x4000660C)) |= 0xFFFFFFF;
		(*(__IO uint32_t *)(0x40006620)) |= 0x3FF;
        (*(__IO uint32_t *)(0x40006640)) = 0x0;
        (*(__IO uint32_t *)(0x40006644)) = 0x0;
        (*(__IO uint32_t *)(0x40006648)) = 0x0;
        (*(__IO uint32_t *)(0x4000664C)) = 0x0;
		(*(__IO uint32_t *)(0x40006650)) = 0x0;
        (*(__IO uint32_t *)(0x40006654)) = 0x0;
        (*(__IO uint32_t *)(0x4000661C)) |= 0xFFFFFFF;	
		(*(__IO uint32_t *)(0x40006620)) |= 0x3FF;	
		(*(__IO uint32_t *)(0x40006600)) |= 0x291D00;
        (*(__IO uint32_t *)(0x40006600)) &= ~0x1; 	
        if(CAN1 == CANx)
        {
            (*(__IO uint32_t *)(0x40006580)) |= 0x3;
            while(!((*(__IO uint32_t *)(0x4000640C)) & 0x3));
            (*(__IO uint32_t *)(0x4000640C)) = 0x38;
        }else if (CAN2 == CANx)
        {
            (*(__IO uint32_t *)(0x40006980)) |= 0x3;
            while(!((*(__IO uint32_t *)(0x4000680C)) & 0x3));
            (*(__IO uint32_t *)(0x4000680C)) = 0x38;
        }else if (CAN3 == CANx)
        {
            (*(__IO uint32_t *)(0x40007980)) |= 0x3;
            while(!((*(__IO uint32_t *)(0x4000780C)) & 0x3));
            (*(__IO uint32_t *)(0x4000780C)) = 0x38;
        }

        if(CAN1 == CANx)
        {
            (*(__IO uint32_t *)(0x40021014)) |= 0x02000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x02000000);
        }else if(CAN2 == CANx)
        {
            (*(__IO uint32_t *)(0x40021014)) |= 0x04000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x04000000);
        }else if(CAN3 == CANx)
		{
			(*(__IO uint32_t *)(0x40021014)) |= 0x01000000;
            (*(__IO uint32_t *)(0x40021014)) &= ~(0x01000000);
		}
        (*(__IO uint32_t *)(0x40006600)) |= 0x1; 	
        (*(__IO uint32_t *)(0x4000660C)) |= 0xFFFFFFF;	
        (*(__IO uint32_t *)(0x4000661C)) |= 0xFFFFFFF;	
		(*(__IO uint32_t *)(0x40006600)) |= 0x291D00;
        (*(__IO uint32_t *)(0x40006600)) &= ~0x1; 	
        wait_ack = 0;

	CANx->CTLR &= (~(uint32_t)CAN_CTLR_SLEEP);
	CANx->CTLR |= CAN_CTLR_INRQ ;

	while (((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
	{
		wait_ack++;
	}

	if ((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK)
	{
		InitStatus = CAN_InitStatus_Failed;
	}
	else 
	{
		if (CAN_InitStruct->CAN_TTCM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_TTCM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_TTCM;
		}

		if (CAN_InitStruct->CAN_ABOM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_ABOM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_ABOM;
		}

		if (CAN_InitStruct->CAN_AWUM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_AWUM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_AWUM;
		}

		if (CAN_InitStruct->CAN_NART == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_NART;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_NART;
		}

		if (CAN_InitStruct->CAN_RFLM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_RFLM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_RFLM;
		}

		if (CAN_InitStruct->CAN_TXFP == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_TXFP;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_TXFP;
		}

		CANx->BTIMR = (uint32_t)((uint32_t)CAN_InitStruct->CAN_Mode << 30) | \
								((uint32_t)CAN_InitStruct->CAN_SJW << 24) | \
								((uint32_t)CAN_InitStruct->CAN_BS1 << 16) | \
								((uint32_t)CAN_InitStruct->CAN_BS2 << 20) | \
								((uint32_t)CAN_InitStruct->CAN_Prescaler - 1);
		CANx->CTLR &= ~(uint32_t)CAN_CTLR_INRQ;
		wait_ack = 0;

		while (((CANx->STATR & CAN_STATR_INAK) == CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
		{
			wait_ack++;
		}

