betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_can.c
		case (CAN_TXMAILBOX_2): 
			CANx->TSTATR |= CAN_TSTATR_ABRQ2;
			break;
		
		default:
			break;
	}
}

/*********************************************************************
 * @fn      CAN_Receive
 *
 * @brief   Receives a message.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *          RxMessage -  pointer to a structure receive message which contains
 *        CAN Id, CAN DLC and CAN datas.
 *
 * @return  none
 */
void CAN_Receive(CAN_TypeDef* CANx, uint8_t FIFONumber, CanRxMsg* RxMessage)
{
	RxMessage->IDE = (uint8_t)0x04 & CANx->sFIFOMailBox[FIFONumber].RXMIR;
	
	if (RxMessage->IDE == CAN_Id_Standard)
	{
		RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 21);
	}
	else
	{
		RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 3);
	}
	
	RxMessage->RTR = (uint8_t)0x02 & CANx->sFIFOMailBox[FIFONumber].RXMIR;
	RxMessage->DLC = (uint8_t)0x0F & CANx->sFIFOMailBox[FIFONumber].RXMDTR;
	RxMessage->Data[0] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RXMDLR;
	RxMessage->Data[1] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 8);
	RxMessage->Data[2] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 16);
	RxMessage->Data[3] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDLR >> 24);
	RxMessage->Data[4] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RXMDHR;
	RxMessage->Data[5] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 8);
	RxMessage->Data[6] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 16);
	RxMessage->Data[7] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDHR >> 24);

	if (FIFONumber == CAN_FIFO0)
	{
		CANx->RFIFO0 |= CAN_RFIFO0_RFOM0;
	}
}

/*********************************************************************
 * @fn      CAN_FIFORelease
 *
 * @brief   Releases the specified FIFO.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *
 * @return  none
 */
void CAN_FIFORelease(CAN_TypeDef* CANx, uint8_t FIFONumber)
{
	if (FIFONumber == CAN_FIFO0)
	{
		CANx->RFIFO0 |= CAN_RFIFO0_RFOM0;
	}
}

/*********************************************************************
 * @fn      CAN_MessagePending
 *
 * @brief   Returns the number of pending messages.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *
 * @return  message_pending - which is the number of pending message.
 */
uint8_t CAN_MessagePending(CAN_TypeDef* CANx, uint8_t FIFONumber)
{
	uint8_t message_pending=0;

	if (FIFONumber == CAN_FIFO0)
	{
		message_pending = (uint8_t)(CANx->RFIFO0&(uint32_t)0x03);
	}
	else
	{
		message_pending = 0;
	}
	
	return message_pending;
}

/*********************************************************************
 * @fn      CAN_OperatingModeRequest
 *
 * @brief   Select the CAN Operation mode.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_OperatingMode - CAN Operating Mode.
 *            CAN_OperatingMode_Initialization.
 *            CAN_OperatingMode_Normal.
 *            CAN_OperatingMode_Sleep.
 *
 * @return  status -
 *            CAN_ModeStatus_Failed - CAN failed entering the specific mode.
 *            CAN_ModeStatus_Success - CAN Succeed entering the specific mode.
 */
uint8_t CAN_OperatingModeRequest(CAN_TypeDef* CANx, uint8_t CAN_OperatingMode)
{
	uint8_t status = CAN_ModeStatus_Failed;
	uint32_t timeout = INAK_TIMEOUT; 

	if (CAN_OperatingMode == CAN_OperatingMode_Initialization)
	{
		CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_SLEEP)) | CAN_CTLR_INRQ);

		while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK) && (timeout != 0))
		{
			timeout--;
		}
		if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK)
		{
			status = CAN_ModeStatus_Failed;
		}
		else
		{
			status = CAN_ModeStatus_Success;
		}
	}
	else if (CAN_OperatingMode == CAN_OperatingMode_Normal)
	{
		CANx->CTLR &= (uint32_t)(~(CAN_CTLR_SLEEP|CAN_CTLR_INRQ));

		while (((CANx->STATR & CAN_MODE_MASK) != 0) && (timeout!=0))
		{
			timeout--;
		}
		if ((CANx->STATR & CAN_MODE_MASK) != 0)
		{
			status = CAN_ModeStatus_Failed;
		}
		else
		{
			status = CAN_ModeStatus_Success;
		}
	}
	else if (CAN_OperatingMode == CAN_OperatingMode_Sleep)
	{
		CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);

		while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK) && (timeout!=0))
		{
			timeout--;
		}
		if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK)
		{
			status = CAN_ModeStatus_Failed;
		}
		else
		{
			status = CAN_ModeStatus_Success;
		}
	}
	else
	{
		status = CAN_ModeStatus_Failed;
	}

	return  (uint8_t) status;
}

/*********************************************************************
 * @fn      CAN_Sleep
 *
 * @brief   Enters the low power mode.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *
 * @return  sleepstatus -
 *            CAN_Sleep_Ok.
 *            CAN_Sleep_Failed.
 */
uint8_t CAN_Sleep(CAN_TypeDef* CANx)
{
	uint8_t sleepstatus = CAN_Sleep_Failed;

	CANx->CTLR = (((CANx->CTLR) & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);
	 
	if ((CANx->STATR & (CAN_STATR_SLAK|CAN_STATR_INAK)) == CAN_STATR_SLAK)
	{
		sleepstatus =  CAN_Sleep_Ok;
	}
	
	return (uint8_t)sleepstatus;
}

/*********************************************************************
 * @fn      CAN_WakeUp
 *
 * @brief   Wakes the CAN up.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *
 * @return  wakeupstatus -
 *            CAN_WakeUp_Ok.
 *            CAN_WakeUp_Failed.
 */
uint8_t CAN_WakeUp(CAN_TypeDef* CANx)
{
	uint32_t wait_slak = SLAK_TIMEOUT;
	uint8_t wakeupstatus = CAN_WakeUp_Failed;
		
	CANx->CTLR &= ~(uint32_t)CAN_CTLR_SLEEP;
		
	while(((CANx->STATR & CAN_STATR_SLAK) == CAN_STATR_SLAK)&&(wait_slak!=0x00))
	{
		 wait_slak--;
	}
	if((CANx->STATR & CAN_STATR_SLAK) != CAN_STATR_SLAK)
	{
		wakeupstatus = CAN_WakeUp_Ok;
	}

	return (uint8_t)wakeupstatus;
}

/*********************************************************************
 * @fn      CAN_GetLastErrorCode
 *
 * @brief   Returns the CANx's last error code (LEC).
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *
 * @return  errorcode - specifies the Error code.
 *            CAN_ErrorCode_NoErr - No Error.
 *            CAN_ErrorCode_StuffErr - Stuff Error.
 *            CAN_ErrorCode_FormErr - Form Error.
 *            CAN_ErrorCode_ACKErr - Acknowledgment Error.
 *            CAN_ErrorCode_BitRecessiveErr - Bit Recessive Error.
 *            CAN_ErrorCode_BitDominantErr - Bit Dominant Error.
 *            CAN_ErrorCode_CRCErr - CRC Error.
 *            CAN_ErrorCode_SoftwareSetErr - Software Set Error.
 */
uint8_t CAN_GetLastErrorCode(CAN_TypeDef* CANx)
{
	uint8_t errorcode=0;
	
