betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_can.c
	errorcode = (((uint8_t)CANx->ERRSR) & (uint8_t)CAN_ERRSR_LEC);
	
	return errorcode;
}

/*********************************************************************
 * @fn      CAN_GetReceiveErrorCounter
 *
 * @brief   Returns the CANx Receive Error Counter (REC).
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *         Note-   
 *         In case of an error during reception, this counter is incremented 
 *         by 1 or by 8 depending on the error condition as defined by the CAN 
 *         standard. After every successful reception, the counter is 
 *         decremented by 1 or reset to 120 if its value was higher than 128. 
 *         When the counter value exceeds 127, the CAN controller enters the 
 *         error passive state.  
 * @return  counter - CAN Receive Error Counter.
 */
uint8_t CAN_GetReceiveErrorCounter(CAN_TypeDef* CANx)
{
	uint8_t counter=0;
	 
	counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_REC)>> 24);
	
	return counter;
}

/*********************************************************************
 * @fn      CAN_GetLSBTransmitErrorCounter
 *
 * @brief   Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *
 * @return  counter - LSB of the 9-bit CAN Transmit Error Counter.
 */
uint8_t CAN_GetLSBTransmitErrorCounter(CAN_TypeDef* CANx)
{
	uint8_t counter=0;
	
	counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_TEC)>> 16);
	
	return counter;
}

/*********************************************************************
 * @fn      CAN_ITConfig
 *
 * @brief   Enables or disables the specified CANx interrupts.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_IT - specifies the CAN interrupt sources to be enabled or disabled.
 *            CAN_IT_TME.
 *            CAN_IT_FMP0.
 *            CAN_IT_FF0.
 *            CAN_IT_FOV0.
 *            CAN_IT_EWG.
 *            CAN_IT_EPV.
 *            CAN_IT_LEC.
 *            CAN_IT_ERR.
 *            CAN_IT_WKU.
 *            CAN_IT_SLK.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  counter - LSB of the 9-bit CAN Transmit Error Counter.
 */
void CAN_ITConfig(CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState)
{
	if (NewState != DISABLE)
	{
		CANx->INTENR |= CAN_IT;
	}
	else
	{
		CANx->INTENR &= ~CAN_IT;
	}
}

/*********************************************************************
 * @fn      CAN_GetFlagStatus
 *
 * @brief   Checks whether the specified CAN flag is set or not.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_FLAG - specifies the flag to check.
 *            CAN_FLAG_EWG.
 *            CAN_FLAG_EPV.
 *            CAN_FLAG_BOF.
 *            CAN_FLAG_RQCP0.
 *            CAN_FLAG_RQCP1.
 *            CAN_FLAG_RQCP2.
 *            CAN_FLAG_FMP0.
 *            CAN_FLAG_FF0.
 *            CAN_FLAG_FOV0.
 *            CAN_FLAG_WKU.
 *            CAN_FLAG_SLAK.
 *            CAN_FLAG_LEC.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus CAN_GetFlagStatus(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{
	FlagStatus bitstatus = RESET;
	
	if((CAN_FLAG & CAN_FLAGS_ERRSR) != (uint32_t)RESET)
	{ 
		if ((CANx->ERRSR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
		{ 
			bitstatus = SET;
		}
		else
		{ 
			bitstatus = RESET;
		}
	}
	else if((CAN_FLAG & CAN_FLAGS_STATR) != (uint32_t)RESET)
	{ 
		if ((CANx->STATR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
		{ 
			bitstatus = SET;
		}
		else
		{ 
			bitstatus = RESET;
		}
	}
	else if((CAN_FLAG & CAN_FLAGS_TSTATR) != (uint32_t)RESET)
	{ 
		if ((CANx->TSTATR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
		{ 
			bitstatus = SET;
		}
		else
		{ 
			bitstatus = RESET;
		}
	}
	else if((CAN_FLAG & CAN_FLAGS_RFIFO0) != (uint32_t)RESET)
	{ 
		if ((CANx->RFIFO0 & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
		{ 
			bitstatus = SET;
		}
		else
		{ 
			bitstatus = RESET;
		}
	}

	return  bitstatus;
}

/*********************************************************************
 * @fn      CAN_ClearFlag
 *
 * @brief   Clears the CAN's pending flags.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_FLAG - specifies the flag to clear.
 *            CAN_FLAG_RQCP0.
 *            CAN_FLAG_RQCP1.
 *            CAN_FLAG_RQCP2.
 *            CAN_FLAG_FF0.
 *            CAN_FLAG_FOV0.
 *            CAN_FLAG_WKU.
 *            CAN_FLAG_SLAK.
 *            CAN_FLAG_LEC.
 *
 * @return  none
 */
void CAN_ClearFlag(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{
	uint32_t flagtmp=0;
	
	if (CAN_FLAG == CAN_FLAG_LEC)
	{
		CANx->ERRSR = (uint32_t)RESET;
	}
	else 
	{
		flagtmp = CAN_FLAG & 0x000FFFFF;

		if ((CAN_FLAG & CAN_FLAGS_RFIFO0)!=(uint32_t)RESET)
		{
			CANx->RFIFO0 = (uint32_t)(flagtmp);
		}
		else if ((CAN_FLAG & CAN_FLAGS_TSTATR)!=(uint32_t)RESET)
		{
			CANx->TSTATR = (uint32_t)(flagtmp);
		}
		else 
		{
			CANx->STATR = (uint32_t)(flagtmp);
		}
	}
}

/*********************************************************************
 * @fn      CAN_GetITStatus
 *
 * @brief   Checks whether the specified CANx interrupt has occurred or not.
 *
 * @param   CANx - where x can be 1...3 to select the CAN peripheral.
 *          CAN_IT -  specifies the CAN interrupt source to check.
 *            CAN_IT_TME.
 *            CAN_IT_FMP0.
 *            CAN_IT_FF0.
 *            CAN_IT_FOV0.
 *            CAN_IT_WKU.
 *            CAN_IT_SLK.
 *            CAN_IT_EWG.
 *            CAN_IT_EPV.
 *            CAN_IT_BOF.
 *            CAN_IT_LEC.
 *            CAN_IT_ERR.
 *
 * @return  ITStatus - SET or RESET.
 */
ITStatus CAN_GetITStatus(CAN_TypeDef* CANx, uint32_t CAN_IT)
{
	ITStatus itstatus = RESET;
	
	if((CANx->INTENR & CAN_IT) != RESET)
	{
		switch (CAN_IT)
		{
			case CAN_IT_TME:
				itstatus = CheckITStatus(CANx->TSTATR, CAN_TSTATR_RQCP0|CAN_TSTATR_RQCP1|CAN_TSTATR_RQCP2);  
				break;
			
			case CAN_IT_FMP0:
				itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FMP0);  
				break;
			
